// 로그인 페이지 JS - login.js

$(function(){ ////////// jQB /////////////////////////

    //// 로그인 버튼 클릭시 유효성 검사하기 //////////////
    /// 유효성 검사내용: 아이디와 비번이 비어있지 않아야함!
    // 대상: #sbtn
    $("#sbtn").click(function(e){

        // 기본 서브밋 이동막기!
        e.preventDefault();
        console.log("로그인검사!");

        // 아이디와 비번 모두 비어있는지 검사!
        if($("#mid").val()==="" || $("#mpw").val()===""){
            alert("아이디와 비밀번호를 모두 입력해야합니다!");
        } //////////// if ////////////////////////////////
        else{
            alert("로그인에 성공하였습니다!");
        } //////////// else /////////////////////////////


    }); ////////////// click ///////////////////

}); //////////////////// jQB /////////////////////////