// 자동 스크롤 기능 - touchScroll_mobile.js


$(function () { /// jQB ////////////////////////

    /* 이벤트 중복발생 막기! */
    // 대상: #top, .indic
    // 막을 이벤트: touchstart, touchend
    // 원리: 이벤트 버블링 막기!(자식이벤트가 부모로 올라가는 현상!)
    // 사용메서드: e.stopPropagation()
    $("#top,.indic,.pslide").on("touchstart touchend", function (e) {
        e.stopPropagation();
    }); /////////// 터치이벤트 버블링 막기 ///////////

    /* 
        [ 자동스크롤 모바일 구현하기 ]

        1. 모바일 이벤트 처리 : 터치스크린에서 사용하는 이벤트 종류
            1) touchstart - 손가락이 화면에 닿을때 발생
            2) touchend - 손가락이 화면에서 떨어질때 발생
            3) touchmove - 손가락이 화면에 닿은채로 움직일때 발생

        2. 화면터치(클릭) 이벤트 관련 위치값 종류
            1) screenX, screenY : 디바이스 화면을 기준한 x,y좌표
            2) clientX, clientY : 브라우저 화면을 기준한 x,y좌표
                                (단, 스크롤 미포함)
            3) pageX, pageY : 스크롤을 포함한 브라우저화면 기준 x,y좌표

            ※ 모바일 터치스크린 기준으로 위치값은 screenX, screenY를 사용!

        3. 터치(스와이프)방향 알아내기
        - 원리: 처음 터치한 위치에서 나중 터치가 끝난위치를 뺀다.
            작은수 - 큰수 = 음수
            큰수 - 작은수 = 양수
        이런 결과로 볼때 스크롤방향과 매칭해 보면
            음수가 나오면 아랫쪽방향 스와이프 -> 스크롤휠 위로
            양수가 나오면 윗쪽방향 스와이프 -> 스크롤휠 아래로
    */
    //// 터치방향을 위한 변수 ///
    let tcd1, tcd2;
    // tcd1 - 처음 터치된 Y축 위치값
    // tcd2 - 나중 터치끝날때 Y축 위치값

    //// 1. 터치 시작시 화면 터치위치값 변수에 넣기 ///
    // 대상: document
    // 사용위치속성: screenY (페이지 이동이 Y축 이므로!)
    $(document).on("touchstart", function (e) { // e-이벤트전달변수

        // 모바일 터치 위치값 변수에 할당하기
        tcd1 = e.originalEvent.touches[0].screenY;
        //console.log("터치시작:" + tcd1);

    }); /////////// touchstart 이벤트함수 /////////////

    //// 2. 터치 끝날때 화면 터치위치값 변수에 넣기 ///
    // 대상: document
    // 사용위치속성: screenY (페이지 이동이 Y축 이므로!)
    $(document).on("touchend", function (e) { // e-이벤트전달변수

        ////// 광스크롤막기 /////////////
        if (psts) return; //돌아가!
        psts = 1; //불허용상태변경!
        setTimeout(() => {
            psts = 0;
        }, 1200);
        // 1.2초애니시간후 허용상태변경 //

        // 1. 모바일 터치 위치값 변수에 할당하기
        tcd2 = e.originalEvent.changedTouches[0].screenY;
        //console.log("터치끝:" + tcd2);

        // 2. 방향판별하기(델타변수)
        let delta = tcd1 - tcd2;
        //console.log("차이:" + delta);

        ////////////////////////////////////////////////
        ////// 여기서 부터는 마우스 휠 코드와 동일함!//////

        //////////////////////////////////////////////
        // 3. 스와이프 방향에 따라 페이지번호 증감하기!//
        //////////////////////////////////////////////

        if (delta > 0) { // 양수면 윗방향 스와이프(다음페이지)
            pno++;
            if (pno === totnum) pno = totnum - 1;
            // 마지막페이지에 고정하기!
        } ////// if ///////////
        else { // 음수면 아랫방향 스와이프(이전페이지)
            pno--;
            if (pno === -1) pno = 0;
            // 첫페이지에 고정하기!
        } /////// else ////////

        //console.log("페이지번호:" + pno);

        //////////////////////////////////////////////
        // 4. 이동할 페이지(.page)의 위치값 알아내기 ///
        //////////////////////////////////////////////

        ////////////////////////////////////////////////////
        // 새로운 페이지 위치값 : 윈도우 높이값 * 페이지순번 //
        let pos = $(window).height() * pno;
        ///////////////////////////////////////////////////

        //console.log("이동위치:" + pos);

        //////////////////////////////////////////////
        // 5. 실제 이동위치로 스크롤 애니메이션 하기 ////
        //////////////////////////////////////////////

        $("html,body").stop().animate({
            scrollTop: pos + "px"
        }, 1000, "easeOutQuint");


        ///////////////////////////////////////////////
        // 6. 페이지번호(pno)에 맞는 GNB 메뉴 변경하기 //
        ///////////////////////////////////////////////
        // 변경대상: .gnb li, .indic li
        $(".gnb li").eq(pno).addClass("on")
            .siblings().removeClass("on");
        $(".indic li").eq(pno).addClass("on")
            .siblings().removeClass("on");
        // 선택된 li 이외의 li형제들 class="on"제거하기

        pageAction();

    }); /////////// touchend 이벤트함수 /////////////


}); //////////////// jQB /////////////////////